In [1]:
import numpy as np
import pandas as pd

In [ ]:
# np.nan is a not assigned value

In [25]:


profile = {
    "Name" : ["Sayan Shil","Arkaprava Roy",np.nan,"Arpan Dey"],
    "UID" : [85576535,5456965,575452,55555524],
    "Level" : [40,54,65,74],
    "RP Level" : [np.nan,85,45,98]
}

df = pd.DataFrame(profile)
df

            Name       UID  Level  RP Level
0     Sayan Shil  85576535     40       NaN
1  Arkaprava Roy   5456965     54      85.0
2            NaN    575452     65      45.0
3      Arpan Dey  55555524     74      98.0

In [ ]:
# isna helps us  to check if there exist any Nan in a particular column

In [26]:
df[pd.isna(df["RP Level"])]

         Name       UID  Level  RP Level
0  Sayan Shil  85576535     40       NaN

In [22]:
# dropna helps us to delete the particular column or row

In [24]:
# Q.1 It is obsererved in table that someone have not entered their name but given their data. Find those and delete then

In [33]:
df.dropna(subset=["Name"], inplace=True) #Using Subset
df

            Name       UID  Level  RP Level
0     Sayan Shil  85576535     40       NaN
1  Arkaprava Roy   5456965     54      85.0
3      Arpan Dey  55555524     74      98.0

In [34]:
#Fillna helps us to fill NaN value

In [35]:
#Q.2 It has seen that "Sayan Shil" has not entered RP Level by mistake, It is informed that his RP level is 153. update in NaN

In [36]:
df.fillna(value=153)

            Name       UID  Level  RP Level
0     Sayan Shil  85576535     40     153.0
1  Arkaprava Roy   5456965     54      85.0
3      Arpan Dey  55555524     74      98.0